In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [2]:
df_2018 = pd.read_csv('2018.csv', index_col=0)

In [3]:
df_2018.head()

,code,dia,cd,hoa,khtn,khxh,su,anh,van,sinh,toan,li,city
NaN,18010226,6.50,8.25,NaN,NaN,5.92,3.0,3.0,3.75,NaN,3.0,NaN,18
NaN,18010229,9.00,8.25,NaN,NaN,7.75,6.0,9.0,7.50,NaN,8.8,NaN,18
NaN,18010232,NaN,NaN,5.5,5.42,NaN,NaN,4.0,5.50,5.0,6.0,5.75,18
NaN,18010242,4.75,7.25,NaN,NaN,5.17,3.5,2.6,5.75,NaN,3.4,NaN,18
NaN,18010247,6.25,8.00,NaN,NaN,5.92,3.5,3.0,6.75,NaN,3.8,NaN,18

In [4]:
df_2018.head()

,code,dia,cd,hoa,khtn,khxh,su,anh,van,sinh,toan,li,city
NaN,18010226,6.50,8.25,NaN,NaN,5.92,3.0,3.0,3.75,NaN,3.0,NaN,18
NaN,18010229,9.00,8.25,NaN,NaN,7.75,6.0,9.0,7.50,NaN,8.8,NaN,18
NaN,18010232,NaN,NaN,5.5,5.42,NaN,NaN,4.0,5.50,5.0,6.0,5.75,18
NaN,18010242,4.75,7.25,NaN,NaN,5.17,3.5,2.6,5.75,NaN,3.4,NaN,18
NaN,18010247,6.25,8.00,NaN,NaN,5.92,3.5,3.0,6.75,NaN,3.8,NaN,18

### Fill missing value by -1

In [5]:
df_2018.isnull().sum()

code         0
dia     311175
cd      365362
hoa     417415
khtn    430538
khxh    365438
su      298278
anh      84398
van      16087
sinh    424791
toan      3372
li      421043
city         0
dtype: int64

In [6]:
df_2018.index

Float64Index([nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
              ...
              nan, nan, nan, nan, nan, nan, nan, nan, nan, nan],
             dtype='float64', length=744396)

In [7]:
df_2018.reset_index(drop=True, inplace=True)

In [8]:
df_2018.index

RangeIndex(start=0, stop=744396, step=1)

In [9]:
df_2018.head()

,code,dia,cd,hoa,khtn,khxh,su,anh,van,sinh,toan,li,city
0,18010226,6.50,8.25,NaN,NaN,5.92,3.0,3.0,3.75,NaN,3.0,NaN,18
1,18010229,9.00,8.25,NaN,NaN,7.75,6.0,9.0,7.50,NaN,8.8,NaN,18
2,18010232,NaN,NaN,5.5,5.42,NaN,NaN,4.0,5.50,5.0,6.0,5.75,18
3,18010242,4.75,7.25,NaN,NaN,5.17,3.5,2.6,5.75,NaN,3.4,NaN,18
4,18010247,6.25,8.00,NaN,NaN,5.92,3.5,3.0,6.75,NaN,3.8,NaN,18

In [10]:
df_2018.describe()

,code,dia,cd,hoa,khtn,khxh,su,anh,van,sinh,toan,li,city
count,7.443960e+05,433221.000000,379034.000000,326981.000000,313858.000000,378958.000000,446118.000000,659998.000000,728309.000000,319605.000000,741024.000000,323353.000000,744396.000000
mean,3.033333e+07,5.483495,7.157468,4.864391,4.791471,5.517752,3.805371,3.933543,5.444146,4.561249,4.884162,4.961179,30.321701
std,1.905104e+07,1.257440,1.233368,1.523851,1.085932,1.003759,1.241262,1.567942,1.447793,1.244402,1.440636,1.531097,19.057832
min,1.000019e+06,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
25%,1.500588e+07,4.750000,6.500000,3.750000,4.000000,4.830000,3.000000,2.800000,4.500000,3.750000,3.800000,3.750000,15.000000
50%,3.200454e+07,5.500000,7.250000,4.750000,4.830000,5.500000,3.750000,3.600000,5.500000,4.500000,5.000000,5.000000,32.000000
75%,4.700776e+07,6.250000,8.000000,6.000000,5.580000,6.170000,4.500000,4.600000,6.500000,5.250000,6.000000,6.000000,47.000000
max,6.400622e+07,10.000000,10.000000,10.000000,9.330000,9.580000,10.000000,10.000000,9.750000,10.000000,10.000000,10.000000,64.000000

In [11]:
top100_toan = df_2018.sort_values(by = 'toan',ascending=False).head(100)

In [12]:
df = top100_toan.groupby(['city'])['toan'].value_counts().groupby(['city']).sum().sort_values(ascending= False)

In [13]:
df

city
2     13
5     12
1     11
15     8
23     7
28     4
26     4
62     3
22     3
10     3
16     3
18     3
57     2
4      2
9      2
12     2
21     2
19     2
33     2
53     1
38     1
60     1
27     1
55     1
41     1
32     1
7      1
56     1
35     1
36     1
40     1
Name: toan, dtype: int64